src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/бир_ЗапросыКДанным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_ЗапросыКДанным</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем ПреобразованиеДанных;    // ОбработкаОбъект   - обработка преобразования данных

&НаКлиенте
Перем ФормаРедактированияЗапроса;    // УправляемаяФорма - форма редактора запроса

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		ТекущееНаименование = Объект.Наименование;

		ПолучитьЗапросСПараметрами();
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекущееНаименование = Объект.Наименование;

	ПолучитьЗапросСПараметрами();

КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьВалидностьИдентификатора();

КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ФормаРедактированияЗапроса = Неопределено;

КонецПроцедуры // ПриЗакрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если ТекущееНаименование = Объект.Наименование Тогда
		Возврат;
	КонецЕсли;

	ТекущийИдентификаторИзНаименования = ИдентификаторИзНаименования(ТекущееНаименование);

	Суффикс = СокрЛП(Сред(Объект.Ид, СтрДлина(ТекущийИдентификаторИзНаименования) + 1));
	
	НужноОбновитьИд = Объект.Ид = ""
	             ИЛИ (Лев(Объект.Ид, СтрДлина(ТекущийИдентификаторИзНаименования)) = ТекущийИдентификаторИзНаименования
	                  И (ОбщегоНазначенияКлиентСервер.ЭтоЧисло(Суффикс) ИЛИ Суффикс = ""));

	Если НужноОбновитьИд Тогда
		Объект.Ид = НовыйИдентификаторЗапроса(Объект.Наименование, Объект.Ссылка);
		ОбновитьВалидностьИдентификатора();
	КонецЕсли;

	ТекущееНаименование = Объект.Наименование;

КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура ИдПриИзменении(Элемент)

	ОбновитьВалидностьИдентификатора();

КонецПроцедуры // ИдПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьЗапрос(Команда)

	ФормаРедактированияЗапроса().Открыть();

КонецПроцедуры // РедактироватьЗапрос()

&НаКлиенте
Процедура ОбновитьИдентификатор(Команда)

	Объект.Ид = НовыйИдентификаторЗапроса(Объект.Наименование, Объект.Ссылка);
	ОбновитьВалидностьИдентификатора();

КонецПроцедуры // ОбновитьИдентификатор()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВалидностьИдентификатора(Знач Идентификатор = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = Объект.Ид;
	КонецЕсли;
	
	ОписаниеИд = ПроверитьИдентификаторЗапроса(Идентификатор, Объект.Ссылка);
	
	Если ОписаниеИд.Свободен И ОписаниеИд.Валиден Тогда
		Элементы.ВалидностьИдентификатора.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Элементы.ВалидностьИдентификатора.Подсказка = "Идентификатор свободен";
		Элементы.ОшибкиИдентификатора.Заголовок = "";
	Иначе
		Элементы.ВалидностьИдентификатора.Картинка = БиблиотекаКартинок.ОформлениеКрест;
		ТекстОшибки = СтрСоединить(ОписаниеИд.Ошибки, Символы.ПС);
		Элементы.ВалидностьИдентификатора.Подсказка = ТекстОшибки;
		Элементы.ОшибкиИдентификатора.Заголовок = ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьВалидностьИдентификатора()

// Функция - возвращает новый идентификатор запроса
// (см. Справочник.бир_ЗапросыКДанным.НовыйИдентификаторЗапроса())
//
&НаСервереБезКонтекста
Функция НовыйИдентификаторЗапроса(Знач Наименование, Знач ЗапросСсылка = Неопределено)

	Возврат Справочники.бир_ЗапросыКДанным.НовыйИдентификаторЗапроса(Наименование, ЗапросСсылка);

КонецФункции // НовыйИдентификаторЗапроса()

// Функция - возвращает новый идентификатор запроса
// (см. Справочник.бир_ЗапросыКДанным.ПроверитьИдентификаторЗапроса())
//
&НаСервереБезКонтекста
Функция ПроверитьИдентификаторЗапроса(Знач Идентификатор, Знач ЗапросСсылка = Неопределено)
	
	Возврат Справочники.бир_ЗапросыКДанным.ПроверитьИдентификаторЗапроса(Идентификатор, ЗапросСсылка);

КонецФункции // ПроверитьИдентификаторЗапроса()

// Функция - возвращает новый идентификатор запроса
// (см. Справочник.бир_ЗапросыКДанным.ИдентификаторИзНаименования())
//
&НаСервереБезКонтекста
Функция ИдентификаторИзНаименования(Знач Наименование)

	Возврат Справочники.бир_ЗапросыКДанным.ИдентификаторИзСтроки(Наименование);

КонецФункции // ИдентификаторИзНаименования()

// Функция - Получает форму редактирования запросов
// 
// Возвращаемое значение:
//	 УправляемаяФорма    - форма редактирования запроса
//
&НаКлиенте
Функция ФормаРедактированияЗапроса()

	Если ФормаРедактированияЗапроса = Неопределено Тогда
		ФормаРедактированияЗапроса = ПолучитьФорму("Обработка.бир_ПроцессорЗапросов.Форма.Форма", , ЭтотОбъект);
		ФормаРедактированияЗапроса.ОписаниеОповещенияОЗакрытии =
			Новый ОписаниеОповещения("ФормаРедактированияЗапросаЗакрытие", ЭтотОбъект);
		ФормаРедактированияЗапроса.УстановитьЗапросСПараметрами(ПолучитьЗапросСПараметрами());
	КонецЕсли;

	Возврат ФормаРедактированияЗапроса;

КонецФункции // ФормаРедактированияЗапроса()

// Процедура - обработчик события закрытия формы редактирования запроса
//
// Параметры:
//   РезультатЗакрытия          - Строка       - данные, возвращенные при закрытии формы
//   ДополнительныеПараметры    - Структура    - параметры обработки
//
&НаКлиенте
Процедура ФормаРедактированияЗапросаЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия = "ИзмененыНастройки" Тогда
		ЗапросСПараметрами = ФормаРедактированияЗапроса().ПолучитьЗапросСПараметрами();
		УстановитьЗапросСПараметрами(ЗапросСПараметрами);
	КонецЕсли;

КонецПроцедуры // ФормаРедактированияЗапросаЗакрытие()

// Процедура - записывает запрос с параметрами в текущий элемент справочника
//
// Параметры:
//   ЗапросСПараметрами     - Структура    - запрос с параметрами
//
&НаСервере
Процедура УстановитьЗапросСПараметрами(Знач ЗапросСПараметрами)

	Если ТипЗнч(ЗапросСПараметрами) = Тип("Структура") Тогда
		ЗапросСПараметрами.Свойство("Запрос_Текст", ТекстЗапроса);
	КонецЕсли;

	ЗапросСПараметрами = ПреобразованиеДанных().ЗначениеВСтруктуру(ЗапросСПараметрами);
	ЗапросСПараметрами = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ЗапросСПараметрами);
	Если НЕ Объект.Запрос = ЗапросСПараметрами Тогда
		Объект.Запрос = ЗапросСПараметрами;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры // УстановитьЗапросСПараметрами()

// Функция - читает запрос с параметрами из текущего элемента справочника
//
// Параметры:
//   ЗапросСПараметрами     - Структура    - запрос с параметрами
//
&НаСервере
Функция ПолучитьЗапросСПараметрами()

	Попытка
		ЗапросСПараметрами = ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(Объект.Запрос);
		ЗапросСПараметрами = ПреобразованиеДанных().ЗначениеИзСтруктуры(ЗапросСПараметрами);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Если ТипЗнч(ЗапросСПараметрами) = Тип("Структура") Тогда
		ЗапросСПараметрами.Свойство("Запрос_Текст", ТекстЗапроса);
	КонецЕсли;
	
	Возврат ЗапросСПараметрами;

КонецФункции // ПолучитьЗапросСПараметрами()

// Функция - Получает обработку сериализации значений
//
// Возвращаемое значение:
//   ВнешняяОбработкаОбъект    - обработка преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных() Экспорт

	Если ПреобразованиеДанных = Неопределено Тогда
		ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	КонецЕсли;

	Возврат ПреобразованиеДанных; 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
